<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{

    
    public function run(): void
    {

            $permissions = [

                'الرئيسية',
                'الصلاحيات',
                'المستخدمين',
                'الاقسام والكليات',
                'المهندسين',
                'الاعدادات',



                'الاجهزة الطبية',
                'اضافة جهاز',
                'عرض جهاز',
                'تعديل جهاز',
                'حذف جهاز',


                'المهام اليومية',
                'اضافة مهام',
                'عرض مهام',
                'تعديل مهام',
                'حذف مهام',



                'اوقات العمل',
                'اضافة وقت',
                'عرض وقت',
                'تعديل وقت',
                'حذف وقت',


                'المخزن',
                'اضافة مادة',
                'عرض مادة',
                'حذف مادة',
                'تعديل مادة',



                'قطع غيار',
                'اضافة قطعة',
                'عرض قطعة',
                'تعديل قطعة',
                'حذف قطعة',



                'الكادر الهندسي',
                'اضافة مهندس',
                'عرض مهندس',
                'تعديل مهندس',
                'حذف مهندس',



                'التقارير الشهرية',
                'اضافة تقرير',
                'عرض تقرير',
                'تعديل تقرير',
                'حذف تقرير',



                'الكتب',
                'اضافة كتاب',
                'عرض كتاب',
                'تعديل كتاب',
                'حذف كتاب',


                'عيادات',
                'اضافة عيادة',
                'عرض عيادة',
                'تعديل عيادة',
                'حذف عيادة',

            ];



            foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
            }

    }
}
